## [ DataFrame 정렬]

- 종류 => 인덱스기반 정렬, 데이터/값 기반 정렬

(1) 모듈 로딩 <hr>

In [7]:
import pandas as pd

(2) 데이터 준비<hr>

(3) 데이터 저장 => DataFrame

- 파일 데이터 읽어서 저장 => pandas.read_파일확장자() --> 반환 : DataFrame

In [9]:
movieDF = pd.read_csv('../DATA/movies.csv')

(4) 데이터 확인 <hr>

In [10]:
movieDF

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

- 데이터 확인 관련 메서드 .info()

데이터의 전체구조 확인 및 대이터 종류 요약

In [11]:
movieDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    782 non-null    int64
 1   Title   782 non-null    object
 2   Studio  782 non-null    object
 3   Gross   782 non-null    object
 4   Year    782 non-null    int64
dtypes: int64(2), object(3)
memory usage: 30.7+ KB

In [17]:
# 컬럼별 통계적인 데이터 정보를 제공
statistic = movieDF.describe()
statistic

             Rank         Year
count  782.000000   782.000000
mean   391.500000  2006.620205
std    225.888247    10.026227
min      1.000000  1939.000000
25%    196.250000  2001.000000
50%    391.500000  2009.000000
75%    586.750000  2014.000000
max    782.000000  2019.000000

In [21]:
# 수치 컬럼의 최소, 최대, 평균 데이터 추출
# for x in statistic.columns:
#     print(f"{x}의 최소값 : {statistic[x].loc['min']}", end=', ')
#     print(f"{x}의 최대값 : {statistic[x].loc['max']}", end=', ')
#     print(f"{x}의 평균값 : {statistic[x].loc['mean']:.2f}", end='\n')

statistic.loc[['min','max','mean']].transpose()

         min     max         mean
Rank     1.0   782.0   391.500000
Year  1939.0  2019.0  2006.620205

## 행 => 열, 열 => 행 치환 가능 속성 및 메서드

- 속성 : DF객체변수명.T (원본 데이터가 바뀌지 않음)
- 메서드 : DF객체변수명.transpose() (inplace 없으므로 반드시 따로 저장)

In [30]:
pd.DataFrame([statistic.Rank.values, statistic.Year.values], columns=statistic.index, index=statistic.columns)

      count         mean         std     min      25%     50%      75%     max
Rank  782.0   391.500000  225.888247     1.0   196.25   391.5   586.75   782.0
Year  782.0  2006.620205   10.026227  1939.0  2001.00  2009.0  2014.00  2019.0

In [31]:
statistic.T

      count         mean         std     min      25%     50%      75%     max
Rank  782.0   391.500000  225.888247     1.0   196.25   391.5   586.75   782.0
Year  782.0  2006.620205   10.026227  1939.0  2001.00  2009.0  2014.00  2019.0

In [32]:
statistic.transpose()

      count         mean         std     min      25%     50%      75%     max
Rank  782.0   391.500000  225.888247     1.0   196.25   391.5   586.75   782.0
Year  782.0  2006.620205   10.026227  1939.0  2001.00  2009.0  2014.00  2019.0

In [35]:
statistic_all = movieDF.describe(include='all')
statistic_all

,Rank,Title,Studio,Gross,Year
count,782.000000,782,782,782,782.000000
unique,NaN,773,37,701,NaN
top,NaN,Beauty and the Beast,Warner Brothers,$225.90,NaN
freq,NaN,2,132,3,NaN
mean,391.500000,NaN,NaN,NaN,2006.620205
std,225.888247,NaN,NaN,NaN,10.026227
min,1.000000,NaN,NaN,NaN,1939.000000
25%,196.250000,NaN,NaN,NaN,2001.000000
50%,391.500000,NaN,NaN,NaN,2009.000000
75%,586.750000,NaN,NaN,NaN,2014.000000
max,782.000000,NaN,NaN,NaN,2019.000000

- (5) 데이터 정렬
    * 인덱스 기반 정렬 => 행인덱스 / 열인덱스

In [36]:
# 행 인덱스 기반 정렬 => DF.sort_index()
movieDF.sort_index(ascending=False)

     Rank                         Title           Studio       Gross  Year
781   782                      Valkyrie              MGM    $200.30   2008
780   781      The Hunt for Red October        Paramount    $200.50   1990
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
778   779           Garfield: The Movie              Fox    $200.80   2004
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
..    ...                           ...              ...         ...   ...
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
2       3                       Titanic        Paramount  $2,187.50   1997
1       2                        Avatar              Fox  $2,789.70   2009
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019

[782 rows x 5 columns]

In [41]:
# 컬럼 인덱스 기반 정렬 => 내림차순

movieDF.sort_index(axis='columns')

          Gross  Rank           Studio                         Title  Year
0    $2,796.30      1      Buena Vista             Avengers: Endgame  2019
1    $2,789.70      2              Fox                        Avatar  2009
2    $2,187.50      3        Paramount                       Titanic  1997
3    $2,068.20      4      Buena Vista  Star Wars: The Force Awakens  2015
4    $2,048.40      5      Buena Vista        Avengers: Infinity War  2018
..          ...   ...              ...                           ...   ...
777    $201.60    778  Warner Brothers                     Yogi Bear  2010
778    $200.80    779              Fox           Garfield: The Movie  2004
779    $200.70    780  Warner Brothers                   Cats & Dogs  2001
780    $200.50    781        Paramount      The Hunt for Red October  1990
781    $200.30    782              MGM                      Valkyrie  2008

[782 rows x 5 columns]

In [49]:
movieDF.sort_values(by=['Year','Title'], axis='index', ascending=False)

     Rank                      Title                  Studio     Gross  Year
571   572                         Us               Universal  $254.70   2019
197   198                Toy Story 4             Buena Vista  $519.80   2019
113   114        The Wandering Earth  China Film Corporation  $699.80   2019
669   670  The Secret Life of Pets 2               Universal  $225.90   2019
339   340                    Shazam!         Warner Brothers  $364.10   2019
..    ...                        ...                     ...       ...   ...
603   604              The Godfather               Paramount  $245.10   1972
754   755            The Jungle Book             Buena Vista  $205.80   1967
707   708             101 Dalmatians             Buena Vista  $215.90   1961
539   540                      Bambi                     RKO  $267.40   1942
287   288         Gone with the Wind                     MGM  $402.40   1939

[782 rows x 5 columns]

- [실습] 다양한 정렬

In [51]:
# import numpy as np
from math import nan

data = {
    'col1' : ['A', 'A', 'B', nan, 'D', 'C'],
    'col2' : [2,1,9,8,7,4],
    'col3' : [0,1,9,4,2,3],
    'col4' : ['a','B','c','D','e','F'],
}

In [52]:
dataDF = pd.DataFrame(data)
dataDF

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [58]:
# NaN 즉, 빈칸 데이터 (결측치) 값의 위치: (기) 파일 마지막
dataDF.sort_values(by=['col1'], ascending=True)

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [60]:
# NaN 즉, 빈칸 데이터 (결측치) 값의 위치 설정 => na_position 파라미터
dataDF.sort_values(by=['col1'], ascending=True, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e

In [64]:
# col4 컬럼을 기준으로 오름차순 정렬 
dataDF.sort_values(by=['col4'], ascending=True, key = lambda x : x.str.upper())

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F